In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C:/Users/Rahul/Desktop/day6/Dataset_1.csv")

In [3]:
df.sample(10)

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
816,ORD1816,user_816,NaN,3500.75,15/02/2023,UPI,DELHI,2,no
753,ORD1753,NaN,65.0,499.99,invalid,NaN,Delhi,-1,yes
191,NaN,NaN,18.0,250.5,2023/03/10,upi,Delhi,1,True
319,NaN,NaN,120.0,NaN,invalid,NaN,Hyderabad,7,False
654,NaN,CUST654,NaN,250.5,invalid,Credit Card,Delhi,2,yes
586,ORD1586,user_586,120.0,NaN,15/02/2023,Credit Card,Hyderabad,7,True
911,NaN,user_911,35.0,250.5,15/02/2023,Debit Card,DELHI,-1,False
601,NaN,CUST601,50.0,250.5,2023/03/10,Debit Card,Hyderabad,three,yes
703,ORD1703,user_703,NaN,1200,2023/03/10,Credit Card,Delhi,-1,True
333,NaN,NaN,NaN,499.99,2023/03/10,Debit Card,Bangalore,7,no

In [4]:
df['is_delivered'] = df['is_delivered'].replace('yes',True)
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,3500.75,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,65.0,1200,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [5]:
df[df['order_amount'].isna() & df['is_delivered']]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,True
6,ORD1006,CUST6,-3.0,NaN,NaN,upi,Bangalore,5,no
7,ORD1007,NaN,120.0,NaN,2023-01-15,CARD,NaN,5,no
8,ORD1008,user_8,18.0,NaN,2023/03/10,Debit Card,NaN,7,False
9,NaN,user_9,NaN,NaN,2023/03/10,UPI,Delhi,-1,no
...,...,...,...,...,...,...,...,...,...
982,NaN,CUST982,25.0,NaN,15/02/2023,NaN,Bangalore,2,True
987,NaN,CUST987,50.0,NaN,2023/03/10,NaN,Bangalore,NaN,True
992,NaN,CUST992,NaN,NaN,2023-01-15,CARD,NaN,three,False
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,True
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [6]:
df['order_amount'].unique()

array(['250.5', '1200', nan, '3500.75', '₹999', '499.99'], dtype=object)

In [7]:
df['order_amount'] = df['order_amount'].replace("₹999","999")
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,3500.75,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,65.0,1200,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [8]:
df["order_amount"] = pd.to_numeric(df['order_amount'],errors="coerce").isna()
df["is_delivered"] = df["is_delivered"].astype(str).str.lower().isin(["true","yes"])
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,False,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,True,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,True,2023/03/10,Cash,Delhi,1,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,True,15/02/2023,Debit Card,NaN,-1,True

In [9]:
df['order_date'].unique()

array(['2023-01-15', '2023/03/10', nan, 'invalid', '15/02/2023'],
      dtype=object)

In [10]:
df['order_date'] = pd.to_datetime(df['order_date'],dayfirst=True,errors="coerce")
df

C:\Users\Rahul\AppData\Local\Temp\ipykernel_12700\500942515.py:1: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df['order_date'] = pd.to_datetime(df['order_date'],dayfirst=True,errors="coerce")

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,False,NaT,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,Mumbai,1,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,True,NaT,Cash,Delhi,1,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,-1,True

In [11]:
df['order_date'].unique()

<DatetimeArray>
['2023-01-15 00:00:00', 'NaT']
Length: 2, dtype: datetime64[ns]

In [12]:
df['delivery_days'] = df['delivery_days'].replace("three",3)
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,False,NaT,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,3,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,3,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,Mumbai,1,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,True,NaT,Cash,Delhi,1,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,-1,True

In [13]:
df['delivery_days'] = pd.to_numeric(df['delivery_days'],errors="coerce")
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5.0,True
1,ORD1001,NaN,18.0,False,NaT,Debit Card,NaN,5.0,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,Mumbai,7.0,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,3.0,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,3.0,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,Mumbai,1.0,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2.0,True
997,NaN,user_997,50.0,True,NaT,Cash,Delhi,1.0,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2.0,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,-1.0,True

In [14]:
df[df['delivery_days']<0]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
9,NaN,user_9,NaN,True,NaT,UPI,Delhi,-1.0,False
11,NaN,CUST11,18.0,False,NaT,Cash,Mumbai,-1.0,False
35,NaN,user_35,50.0,False,NaT,Cash,DELHI,-1.0,True
47,NaN,user_47,25.0,True,NaT,Cash,Mumbai,-1.0,False
49,ORD1049,CUST49,120.0,False,NaT,NaN,Hyderabad,-1.0,False
...,...,...,...,...,...,...,...,...,...
936,ORD1936,user_936,NaN,True,NaT,UPI,Bangalore,-1.0,False
937,ORD1937,CUST937,-3.0,True,2023-01-15,Debit Card,mumbai,-1.0,True
938,ORD1938,user_938,65.0,False,NaT,upi,mumbai,-1.0,False
945,ORD1945,NaN,NaN,False,2023-01-15,NaN,mumbai,-1.0,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,-1.0,True

In [15]:
df['delivery_days'].notna()

0      True
1      True
2      True
3      True
4      True
       ...
995    True
996    True
997    True
998    True
999    True
Name: delivery_days, Length: 1000, dtype: bool

In [16]:
df['order_date'].notna()

0       True
1      False
2      False
3       True
4       True
       ...
995    False
996     True
997    False
998     True
999    False
Name: order_date, Length: 1000, dtype: bool

In [17]:
df['delivery_days'].notna().value_counts()

delivery_days
True     849
False    151
Name: count, dtype: int64

In [18]:
df['payment_mode'].unique()

array(['Debit Card', nan, 'Cash', 'CARD', 'upi', 'UPI', 'Credit Card'],
      dtype=object)

In [19]:
df['payment_mode'].str.lower()

0       debit card
1       debit card
2              NaN
3             cash
4             card
          ...
995            upi
996    credit card
997           cash
998            NaN
999     debit card
Name: payment_mode, Length: 1000, dtype: object

In [20]:
df['payment_mode'].str.strip()

0       Debit Card
1       Debit Card
2              NaN
3             Cash
4             CARD
          ...
995            upi
996    Credit Card
997           Cash
998            NaN
999     Debit Card
Name: payment_mode, Length: 1000, dtype: object

In [21]:
df['payment_mode'].value_counts()

payment_mode
Cash           158
UPI            157
CARD           151
Debit Card     141
upi            135
Credit Card    123
Name: count, dtype: int64

In [22]:
df['city'] = df['city'].str.strip()
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5.0,True
1,ORD1001,NaN,18.0,False,NaT,Debit Card,NaN,5.0,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,Mumbai,7.0,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,3.0,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,3.0,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,Mumbai,1.0,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,Hyderabad,2.0,True
997,NaN,user_997,50.0,True,NaT,Cash,Delhi,1.0,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,Mumbai,2.0,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,-1.0,True

In [23]:
df['city'] = df['city'].str.lower()

In [24]:
df['city'] = df['city'].value_counts()
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,Debit Card,NaN,5.0,True
1,ORD1001,NaN,18.0,False,NaT,Debit Card,NaN,5.0,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,NaN,7.0,True
3,ORD1003,user_3,35.0,False,2023-01-15,Cash,NaN,3.0,False
4,ORD1004,user_4,-3.0,False,2023-01-15,CARD,NaN,3.0,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,NaN,1.0,True
996,NaN,CUST996,18.0,True,2023-01-15,Credit Card,NaN,2.0,True
997,NaN,user_997,50.0,True,NaT,Cash,NaN,1.0,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,NaN,2.0,False
999,NaN,user_999,120.0,True,NaT,Debit Card,NaN,-1.0,True

In [25]:
df['city'].unique()

array([nan])


share = (
    df.groupby(["city","payment_mode"]).size()       
)

percentage = share / share.groupby(level=0).sum() * 100

percentage_df = percentage.reset_index(name = 'percentage')

percentage_df

In [26]:
df['payment_mode']=df['payment_mode'].str.strip().str.lower()
df['city']=df['city'].str.strip().str.lower()
share=(df.groupby(["city","payment_mode"]).size())
percentage=share/share.groupby(level=0).sum()*100
percentage=pd.DataFrame(percentage).reset_index()
percentage = percentage.rename(columns={0: 'percentage_share'})
percentage.head(10)

AttributeError: Can only use .str accessor with string values!

In [27]:
df['customer_age'].unique()

array([ nan,  18.,  35.,  -3., 120.,  65.,  25.,  50.])

In [28]:
df['customer_age'].isna()

0       True
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: customer_age, Length: 1000, dtype: bool

In [32]:

df['customer_age'] = pd.to_numeric(df['customer_age'],errors='coerce')

df['order_amount'] = pd.to_numeric(df['order_amount'],errors='coerce')
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,False,2023-01-15,debit card,NaN,5.0,True
1,ORD1001,NaN,18.0,False,NaT,debit card,NaN,5.0,True
2,ORD1002,CUST2,35.0,True,NaT,NaN,NaN,7.0,True
3,ORD1003,user_3,35.0,False,2023-01-15,cash,NaN,3.0,False
4,ORD1004,user_4,-3.0,False,2023-01-15,card,NaN,3.0,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,False,NaT,upi,NaN,1.0,True
996,NaN,CUST996,18.0,True,2023-01-15,credit card,NaN,2.0,True
997,NaN,user_997,50.0,True,NaT,cash,NaN,1.0,False
998,ORD1998,NaN,65.0,False,2023-01-15,NaN,NaN,2.0,False
999,NaN,user_999,120.0,True,NaT,debit card,NaN,-1.0,True

# 5. find duplicate customer_ids where the same customer placed orders in multiple cities.

In [33]:
df['customer_id'].unique()

array([nan, 'CUST2', 'user_3', 'user_4', 'CUST6', 'user_8', 'user_9',
       'CUST11', 'CUST13', 'CUST14', 'CUST15', 'user_18', 'user_19',
       'CUST24', 'user_26', 'CUST28', 'user_29', 'user_30', 'user_31',
       'user_33', 'user_35', 'CUST36', 'CUST38', 'user_42', 'user_47',
       'CUST49', 'user_51', 'user_53', 'user_54', 'CUST55', 'user_56',
       'CUST57', 'CUST61', 'user_65', 'user_67', 'user_68', 'user_69',
       'user_74', 'CUST75', 'CUST78', 'CUST79', 'CUST80', 'user_81',
       'user_82', 'user_84', 'CUST87', 'user_89', 'user_95', 'CUST96',
       'user_97', 'user_102', 'user_103', 'CUST108', 'CUST111',
       'user_112', 'user_113', 'CUST117', 'CUST119', 'CUST120', 'CUST121',
       'CUST122', 'CUST123', 'CUST126', 'CUST129', 'user_130', 'user_131',
       'CUST132', 'CUST133', 'user_135', 'CUST139', 'user_140',
       'user_142', 'user_143', 'user_144', 'CUST146', 'user_147',
       'CUST149', 'CUST152', 'CUST155', 'CUST156', 'CUST157', 'user_162',
       'CUST163', 'CUST167', 'CUST171', 'user_172', 'user_173', 'CUST175',
       'user_176', 'CUST178', 'CUST180', 'CUST181', 'user_183', 'CUST184',
       'CUST186', 'user_188', 'CUST190', 'user_193', 'CUST194', 'CUST197',
       'CUST200', 'CUST202', 'CUST203', 'CUST204', 'user_205', 'CUST208',
       'user_211', 'user_216', 'CUST219', 'CUST220', 'CUST225',
       'user_226', 'CUST227', 'user_228', 'CUST229', 'CUST230', 'CUST232',
       'CUST234', 'CUST237', 'user_238', 'CUST239', 'user_240', 'CUST247',
       'user_248', 'user_251', 'user_253', 'user_254', 'user_255',
       'user_259', 'CUST260', 'user_261', 'CUST262', 'CUST265', 'CUST267',
       'user_268', 'user_269', 'CUST271', 'user_272', 'user_273',
       'user_278', 'CUST280', 'CUST282', 'CUST285', 'user_286', 'CUST288',
       'CUST290', 'user_292', 'CUST293', 'user_294', 'CUST295', 'CUST296',
       'user_297', 'CUST300', 'user_303', 'user_305', 'CUST306',
       'CUST307', 'user_309', 'user_311', 'CUST312', 'user_313',
       'CUST316', 'user_318', 'user_320', 'CUST321', 'user_323',
       'user_324', 'CUST325', 'CUST326', 'CUST328', 'CUST330', 'user_331',
       'user_334', 'CUST336', 'user_340', 'CUST347', 'user_348',
       'user_350', 'user_352', 'CUST355', 'user_356', 'CUST359',
       'CUST360', 'CUST361', 'CUST362', 'user_365', 'user_366', 'CUST368',
       'CUST369', 'user_371', 'CUST376', 'user_377', 'CUST378',
       'user_379', 'user_382', 'CUST383', 'CUST390', 'CUST391',
       'user_392', 'user_394', 'CUST397', 'user_398', 'CUST401',
       'user_403', 'CUST405', 'CUST409', 'CUST411', 'user_412', 'CUST414',
       'user_415', 'CUST418', 'user_421', 'CUST426', 'CUST427',
       'user_428', 'user_429', 'CUST430', 'CUST435', 'user_436',
       'user_437', 'CUST438', 'user_441', 'CUST446', 'CUST448', 'CUST449',
       'user_451', 'user_452', 'CUST456', 'user_457', 'CUST458',
       'CUST461', 'user_462', 'CUST464', 'user_465', 'CUST470',
       'user_475', 'CUST477', 'CUST478', 'CUST479', 'CUST480', 'CUST483',
       'user_488', 'user_490', 'user_491', 'CUST492', 'user_495',
       'CUST497', 'user_498', 'CUST499', 'CUST502', 'user_503',
       'user_504', 'user_505', 'user_507', 'CUST508', 'user_509',
       'user_511', 'CUST512', 'user_514', 'CUST518', 'user_520',
       'CUST521', 'user_522', 'CUST523', 'user_526', 'user_527',
       'user_528', 'user_535', 'CUST536', 'CUST537', 'user_539',
       'CUST540', 'CUST541', 'user_543', 'CUST544', 'user_546', 'CUST548',
       'user_549', 'user_550', 'CUST551', 'user_554', 'CUST556',
       'user_558', 'user_560', 'user_561', 'CUST562', 'CUST563',
       'user_564', 'CUST566', 'CUST567', 'user_568', 'user_569',
       'CUST580', 'CUST581', 'user_582', 'CUST583', 'user_584', 'CUST585',
       'user_586', 'CUST587', 'CUST588', 'CUST589', 'CUST590', 'CUST593',
       'CUST595', 'CUST599', 'CUST601', 'user_602', 'user_605', 'CUST611',
       'CUST612', 'user_618', 'CUST619', 'user_620', 'CUST623', 'CUST625',
       'CUST626', 'user_627', 'user_629', 'user_630', 'user_631',
       'user_632', 'CUST633', 'CUST634', 'CUST635', 'user_636',
       'user_637', 'CUST639', 'CUST642', 'user_643', 'user_647',
       'user_648', 'user_651', 'CUST652', 'CUST654', 'user_655',
       'CUST656', 'CUST659', 'user_666', 'user_668', 'user_669',
       'user_675', 'user_676', 'user_677', 'user_678', 'CUST680',
       'CUST681', 'CUST684', 'CUST685', 'user_686', 'user_687', 'CUST690',
       'user_691', 'user_694', 'CUST697', 'user_699', 'user_703',
       'CUST704', 'user_707', 'user_709', 'user_710', 'CUST712',
       'CUST714', 'user_716', 'CUST724', 'CUST725', 'user_729', 'CUST730',
       'user_731', 'user_738', 'CUST739', 'user_740', 'CUST741',
       'user_743', 'CUST746', 'CUST747', 'user_755', 'CUST761',
       'user_762', 'CUST764', 'user_766', 'CUST767', 'user_769',
       'CUST771', 'user_773', 'user_774', 'user_776', 'CUST777',
       'user_783', 'CUST784', 'CUST785', 'user_788', 'user_789',
       'user_795', 'user_796', 'CUST798', 'CUST801', 'CUST803',
       'user_806', 'user_807', 'CUST808', 'CUST809', 'user_810',
       'CUST811', 'user_814', 'user_816', 'CUST817', 'CUST818', 'CUST820',
       'CUST821', 'user_822', 'user_833', 'user_838', 'user_841',
       'user_844', 'user_847', 'CUST848', 'user_852', 'CUST853',
       'user_857', 'CUST861', 'user_862', 'user_863', 'CUST866',
       'CUST869', 'user_874', 'CUST875', 'CUST876', 'user_877', 'CUST879',
       'user_880', 'user_881', 'user_882', 'CUST884', 'CUST885',
       'user_887', 'user_888', 'CUST889', 'CUST891', 'CUST892', 'CUST893',
       'user_895', 'user_896', 'user_897', 'CUST900', 'user_902',
       'CUST903', 'CUST907', 'user_911', 'user_912', 'CUST913', 'CUST916',
       'user_917', 'user_918', 'user_920', 'user_921', 'user_923',
       'CUST925', 'user_929', 'CUST931', 'user_932', 'user_935',
       'user_936', 'CUST937', 'user_938', 'CUST939', 'user_942',
       'user_943', 'CUST946', 'user_951', 'user_953', 'user_954',
       'CUST955', 'CUST956', 'user_958', 'user_959', 'user_961',
       'CUST963', 'CUST974', 'user_977', 'CUST978', 'CUST980', 'CUST982',
       'CUST985', 'CUST987', 'CUST992', 'user_995', 'CUST996', 'user_997',
       'user_999'], dtype=object)

In [34]:
df['city'].unique()

array([nan])

In [38]:

unique_city = df.groupby('customer_id')['city'].nunique()
unique_city
cust_order = unique_city[(unique_city)>1].reset_index()
cust_order

Empty DataFrame
Columns: [customer_id, city]
Index: []

# 6.create a flag for orders here delivery_days is missing but is_delivered id true

In [39]:
df["is_delivered_flag"] = (
    df["is_delivered"]
    .astype(str)
    .str.lower()
    .isin(["true", "yes", "1"])
)


df["missing"] = (
    df["delivery_days"].isna() & df["is_delivered_flag"]
)
df['missing']

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: missing, Length: 1000, dtype: bool

# 7.create a flag column that marks orders where delivery days are missing, but the order is marked as delivered

In [41]:
df['delivery_miss_but_delivered'] = (df['delivery_days'].isna() & df['is_delivered'].astype(str).str.lower().isin(['true','yes']))
df['delivery_miss_but_delivered'].value_counts()

delivery_miss_but_delivered
False    937
True      63
Name: count, dtype: int64

# 8. After cleaning , computer the average order value per payment mode , excluding invalid amounts.

In [43]:
avg_ord_value = (df.groupby('payment_mode')['order_amount'].mean().reset_index(name="avg_ord_vale"))
avg_ord_value

  payment_mode  avg_ord_vale
0         card      0.218543
1         cash      0.259494
2  credit card      0.325203
3   debit card      0.276596
4          upi      0.311644

# 9. Identify cities where more than 30% of orders have missing order_date.

In [49]:
city_missing = (df.assign(missing = df['order_date'].isna())
                         .groupby('city')['missing']
                         .mean()
                         .mul(100)
)
city_missing[city_missing > 30]

Series([], Name: missing, dtype: float64)